Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicSymbolAttributes.Size Property
 The size of the mark symbol.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Size { get; set; }
Public Property Size As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ViewMarkBasicSymbolAttributes Class
Tekla.Structures.Drawing Namespace